Autodesk.Revit.DB.ExternalResourceMatchOptions.#ctor(Autodesk.Revit.DB.ExternalResourceType)
Constructs new instance with specified resource type.
resourceType:
The desired resource type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015